Console.WriteLine("Type User to proceed"); //вывод строки в консоли для отображения
string? name = Console.ReadLine(); // Объявил переменную, но не присвоил конкретное значение для считывания с консоли (пока сложно понять, как запросить ввод определенного значения без конструкций). В текущем варианте присваивания значения ничего не даст, введи в консоль что угодно - она с тобой поздоровается. Ну и условия вроде бы не было.
Console.WriteLine("Hello, User"); // ответ на введенное пользователем в консоль значение
